In [2]:
%load_ext sql
%sql mysql://root:root@localhost/testingexam_db

# Question 1. Tạo bảng vớiràng buộc và kiểu dữ liệu. Sau đó, thêm ít nhất 5 bản ghi vào bảng

In [6]:
%%sql
DESCRIBE Customers;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
6 rows affected.

[('CustomerID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'varchar(255)', 'YES', '', None, ''),
 ('Phone', 'varchar(20)', 'YES', '', None, ''),
 ('Email', 'varchar(255)', 'YES', '', None, ''),
 ('Address', 'varchar(255)', 'YES', '', None, ''),
 ('Note', 'varchar(255)', 'YES', '', None, '')]

In [7]:
%%sql
DESCRIBE Cars;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
6 rows affected.

[('CarID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Maker', "enum('HONDA','TOYOTA','NISSAN')", 'YES', '', None, ''),
 ('Model', 'varchar(255)', 'YES', '', None, ''),
 ('Year', 'int', 'YES', '', None, ''),
 ('Color', 'varchar(50)', 'YES', '', None, ''),
 ('Note', 'varchar(255)', 'YES', '', None, '')]

In [8]:
%%sql
DESCRIBE Car_Order;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
10 rows affected.

[('OrderID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('CustomerID', 'int', 'YES', 'MUL', None, ''),
 ('CarID', 'int', 'YES', 'MUL', None, ''),
 ('Amount', 'int', 'YES', '', '1', ''),
 ('SalePrice', 'decimal(10,2)', 'YES', '', None, ''),
 ('OrderDate', 'date', 'YES', '', None, ''),
 ('DeliveryDate', 'date', 'YES', '', None, ''),
 ('DeliveryAddress', 'varchar(255)', 'YES', '', None, ''),
 ('Status', 'int', 'YES', '', '0', ''),
 ('Note', 'varchar(255)', 'YES', '', None, '')]

# Question 2. Truy vấn thông tin Khách hàng (tên, số lượng oto khách hàng đã mua) và sắp sếp tăng dần theo số lượng Ô-tô đã mua

In [47]:
%%sql
SELECT      cu.Name, SUM(co.Amount) AS NUM_CARS, cu.Note
FROM        Customers   AS cu
LEFT JOIN   Car_Order   AS co   ON  co.CustomerID = cu.CustomerID
GROUP BY    cu.Name, cu.Note
ORDER BY    NUM_CARS;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
15 rows affected.

[('Trần Văn Bình', Decimal('2'), 'Khách hàng mới'),
 ('Nguyễn Văn Anh', Decimal('2'), 'Khách hàng thân thiết'),
 ('Trần Thị Bích', Decimal('2'), 'Khách hàng mới'),
 ('Lê Văn Hùng', Decimal('4'), 'Khách hàng thân thiết'),
 ('Trần Thị Mai', Decimal('4'), 'Khách hàng mới'),
 ('Hoàng Thị Thủy', Decimal('4'), 'Khách hàng mới'),
 ('Hoàng Văn Em', Decimal('4'), 'Khách hàng đang quan tâm'),
 ('Nguyễn Thị Thanh', Decimal('5'), 'Khách hàng thân thiết'),
 ('Lê Thị Lan', Decimal('7'), 'Khách hàng thân thiết'),
 ('Phạm Thị Duyên', Decimal('7'), 'Khách hàng quen'),
 ('Phạm Văn Lâm', Decimal('8'), 'Khách hàng đang quan tâm'),
 ('Lê Thị Cẩm Hà', Decimal('10'), 'Khách hàng VIP'),
 ('Trần Văn Dương', Decimal('11'), 'Khách hàng VIP'),
 ('Nguyễn Văn Nam', Decimal('13'), 'Khách hàng VIP'),
 ('Nguyễn Thị Hương', Decimal('14'), 'Khách hàng VIP')]

# Question 3. Viết hàm (không có Parameter) trả về Tên hãng sản xuất đã bán được nhiều Ô-tô nhất trong năm nay

In [48]:
%%sql
SELECT      ca.Maker, YEAR(co.DeliveryDate) AS YEAR_SALE, SUM(co.Amount) AS NUM_CARS
FROM        Cars        AS ca 
LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
WHERE       co.DeliveryDate     IS NOT NULL 
GROUP BY    ca.Maker, YEAR_SALE
ORDER BY    YEAR_SALE, NUM_CARS DESC;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
8 rows affected.

[('TOYOTA', 2022, Decimal('8')),
 ('HONDA', 2022, Decimal('7')),
 ('TOYOTA', 2023, Decimal('17')),
 ('HONDA', 2023, Decimal('3')),
 ('NISSAN', 2023, Decimal('3')),
 ('NISSAN', 2024, Decimal('12')),
 ('TOYOTA', 2024, Decimal('9')),
 ('HONDA', 2024, Decimal('9'))]

In [49]:
%%sql
SELECT      ca.Maker, YEAR(co.DeliveryDate) AS YEAR_SALE, SUM(co.Amount) AS NUM_CARS
FROM        Cars        AS ca 
LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
GROUP BY    ca.Maker, YEAR_SALE
HAVING      YEAR_SALE = YEAR(CURRENT_DATE())
ORDER BY    NUM_CARS DESC;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
3 rows affected.

[('NISSAN', 2024, Decimal('12')),
 ('HONDA', 2024, Decimal('9')),
 ('TOYOTA', 2024, Decimal('9'))]

In [50]:
%%sql
SELECT      SUM(co.Amount) AS NUM_CARS
FROM        Cars        AS ca 
LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
GROUP BY    ca.Maker
ORDER BY    NUM_CARS DESC;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
3 rows affected.

[(Decimal('12'),), (Decimal('9'),), (Decimal('9'),)]

In [51]:
%%sql
SELECT  MAX(NUM_CARS)
FROM    (SELECT      SUM(co.Amount) AS NUM_CARS
        FROM        Cars        AS ca 
        LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
        WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
        GROUP BY    ca.Maker) AS TotalCars;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
1 rows affected.

[(Decimal('12'),)]

In [52]:
%%sql
SELECT      ca.Maker
FROM        Cars        AS ca 
LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
GROUP BY    ca.Maker
HAVING      SUM(co.Amount) =    (SELECT  MAX(NUM_CARS)
                                FROM    (SELECT      SUM(co.Amount) AS NUM_CARS
                                        FROM        Cars        AS ca 
                                        LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
                                        WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
                                        GROUP BY    ca.Maker) AS TotalCars);

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
1 rows affected.

[('NISSAN',)]

In [60]:
%%sql
CREATE FUNCTION GetBestSellingCarMaker()
RETURNS VARCHAR(50) DETERMINISTIC
BEGIN
    DECLARE BestMaker VARCHAR(50);

    SELECT      ca.Maker    INTO    BestMaker
    FROM        Cars        AS ca 
    LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
    WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
    GROUP BY    ca.Maker
    HAVING      SUM(co.Amount) =    (SELECT  MAX(NUM_CARS)
                                    FROM    (SELECT      SUM(co.Amount) AS NUM_CARS
                                            FROM        Cars        AS ca 
                                            LEFT JOIN   Car_Order   AS co   ON co.CarID = ca.CarID
                                            WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
                                            GROUP BY    ca.Maker) AS TotalCars);

    RETURN BestMaker;
END;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
0 rows affected.

[]

In [61]:
%%sql
SELECT GetBestSellingCarMaker();

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
1 rows affected.

[('NISSAN',)]

In [ ]:
%%sql
# DELIMITER //

CREATE FUNCTION GetBestSellingCarMakers()
RETURNS VARCHAR(255) DETERMINISTIC
BEGIN
    DECLARE BestAmount INT;
    DECLARE BestMakers VARCHAR(255);

    #Tìm ra doanh số bán hàng lớn nhất
    SELECT MAX(TotalCars) INTO BestAmount
    FROM (
        SELECT      SUM(co.Amount)  AS TotalCars
        FROM        Cars            AS ca
        LEFT JOIN   Car_Order       AS co       ON co.CarID = ca.CarID
        WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
        GROUP BY    ca.Maker
        ) AS MaxCars;

    # Lấy ra tất cả các hãng xe có doanh số bán hàng bằng với doanh số lớn nhất
    SELECT GROUP_CONCAT(ca.Maker) INTO BestMakers
    FROM (
        SELECT      ca.Maker, SUM(co.Amount) AS TotalCars
        FROM        Cars        AS ca
        LEFT JOIN   Car_Order   AS co ON co.CarID = ca.CarID
        WHERE       YEAR(co.DeliveryDate) = YEAR(CURRENT_DATE())
        GROUP BY    ca.Maker
        ) AS CarsWithMax
    WHERE CarsWithMax.TotalCars = BestAmount;

    RETURN BestMakers;
END #//
# DELIMITER ;

# Question 4. Viết 1 thủ tục (không có Parameter) để Xóa các Đơn hàng đã bị hủy của những năm trước. In ra số lượng bản ghi đã bị xóa

In [63]:
%%sql
SELECT  *
FROM    Car_Order
WHERE   DeliveryDate IS NULL
AND     YEAR(OrderDate) < YEAR(CURRENT_DATE());

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
5 rows affected.

[(5, 6, 3, 1, Decimal('19000.00'), datetime.date(2022, 4, 10), None, '456 Lê Lợi, Quận Ninh Kiều, Tp. Cần Thơ', 2, None),
 (8, 10, 1, 1, Decimal('27000.00'), datetime.date(2022, 7, 25), None, '456 Hai Bà Trưng, Quận 1, Tp. Hồ Chí Minh', 2, None),
 (11, 5, 6, 3, Decimal('22000.00'), datetime.date(2023, 4, 5), None, '456 Lê Lợi, Quận Ninh Kiều, Tp. Cần Thơ', 2, None),
 (13, 6, 6, 2, Decimal('26000.00'), datetime.date(2023, 5, 11), None, '123 Nguyễn Văn Cừ, Quận Bình Thạnh, Tp. Hồ Chí Minh', 2, None),
 (22, 7, 9, 3, Decimal('22000.00'), datetime.date(2023, 12, 10), None, '456 Hai Bà Trưng, Quận 1, Tp. Hồ Chí Minh', 2, None)]

In [64]:
%%sql
SELECT  *
FROM    Car_Order
WHERE   Status = 2
AND     YEAR(OrderDate) < YEAR(CURRENT_DATE());

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
5 rows affected.

[(5, 6, 3, 1, Decimal('19000.00'), datetime.date(2022, 4, 10), None, '456 Lê Lợi, Quận Ninh Kiều, Tp. Cần Thơ', 2, None),
 (8, 10, 1, 1, Decimal('27000.00'), datetime.date(2022, 7, 25), None, '456 Hai Bà Trưng, Quận 1, Tp. Hồ Chí Minh', 2, None),
 (11, 5, 6, 3, Decimal('22000.00'), datetime.date(2023, 4, 5), None, '456 Lê Lợi, Quận Ninh Kiều, Tp. Cần Thơ', 2, None),
 (13, 6, 6, 2, Decimal('26000.00'), datetime.date(2023, 5, 11), None, '123 Nguyễn Văn Cừ, Quận Bình Thạnh, Tp. Hồ Chí Minh', 2, None),
 (22, 7, 9, 3, Decimal('22000.00'), datetime.date(2023, 12, 10), None, '456 Hai Bà Trưng, Quận 1, Tp. Hồ Chí Minh', 2, None)]

In [70]:
%%sql
SELECT  COUNT(*)
FROM    (
        SELECT  *
        FROM    Car_Order
        WHERE   Status = 2
        AND     YEAR(OrderDate) < YEAR(CURRENT_DATE())
        ) AS deleted_row;

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
1 rows affected.

[(5,)]

In [7]:
%%sql
DROP PROCEDURE IF EXISTS    sp_DeleteCancelledOrdersFromPreviousYears;

CREATE PROCEDURE            sp_DeleteCancelledOrdersFromPreviousYears()
BEGIN
    DECLARE num_deleted INT;

    CREATE TEMPORARY TABLE IF NOT EXISTS TempCancelledOrders LIKE Car_Order;

    TRUNCATE TABLE TempCancelledOrders;

    INSERT INTO TempCancelledOrders
    SELECT  *
    FROM    Car_Order
    WHERE   Status = 2
    AND     YEAR(OrderDate) < YEAR(CURRENT_DATE());

    SELECT  COUNT(*)    INTO num_deleted
    FROM    (
            SELECT  *
            FROM    Car_Order
            WHERE   Status = 2
            AND     YEAR(OrderDate) < YEAR(CURRENT_DATE())
            ) AS deleted_row;

    DELETE  
    FROM    Car_Order
    WHERE   Status = 2 
    AND     YEAR(OrderDate) < YEAR(CURRENT_DATE());

    SELECT CONCAT('Số lượng bản ghi đã bị xóa: ', num_deleted) AS Message;

    TRUNCATE TABLE TempCancelledOrders;
END;

 * mysql://root:***@localhost/TestingExam_Db
0 rows affected.
0 rows affected.

[]

In [11]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='TestingExam_Db')
cursor = conn.cursor()
cursor.callproc('DeleteCancelledOrdersFromPreviousYears')


# Lấy kết quả từ lệnh SELECT cuối cùng trong thủ tục
results = cursor.fetchall()
print(results)

('Số lượng bản ghi đã bị xóa: 5',)

## ROW_COUNT()

In [3]:
%%sql
DROP    PROCEDURE IF EXISTS     sp_DeleteCancelledOrdersFromPreviousYears2();
CREATE  PROCEDURE               sp_DeleteCancelledOrdersFromPreviousYears2()
BEGIN
    DECLARE num_deleted INT;

    DELETE  FROM Car_Order
    WHERE   Status = 2
    AND     YEAR(OrderDate) < YEAR(CURRENT_DATE());

    SET num_deleted = ROW_COUNT();

    SELECT CONCAT('Số lượng bản ghi đã bị xóa: ', num_deleted) AS Message;
END;

 * mysql://root:***@localhost/TestingExam_Db
0 rows affected.

[]

In [4]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='TestingExam_Db')
cursor = conn.cursor()
cursor.callproc('DeleteCancelledOrdersFromPreviousYears2')


# Lấy kết quả từ lệnh SELECT cuối cùng trong thủ tục
results = cursor.fetchall()
print(results)

(('Số lượng bản ghi đã bị xóa: 5',),)

---

Dùng ROW_COUNT() để đếm số hàng vừa bị thay đổi (INSERT hoặc DELETE) trong cùng một phiên làm việc

Tuy nhiên, lại không thực hiện được trong `ipython-sql`

In [92]:
%%sql
INSERT INTO Car_Order   (CustomerID , CarID , Amount, SalePrice , OrderDate     )  
VALUES                  (2          , 1     , 4     , 25000.00  , '1999-01-15'  );

SELECT  ROW_COUNT();

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
1 rows affected.
1 rows affected.

[(0,)]

In [93]:
%%sql
DELETE  
FROM    Car_Order
WHERE   YEAR(OrderDate) = 1999;

SELECT  ROW_COUNT();

   mysql://root:***@localhost
 * mysql://root:***@localhost/TestingExam_Db
1 rows affected.
1 rows affected.

[(0,)]

Sử dụng `mysqlclient`

In [95]:
import MySQLdb

# Kết nối đến cơ sở dữ liệu MySQL
connection = MySQLdb.connect(
    host="localhost",
    user="root",
    password="root",
    database="TestingExam_Db"
)

# Tạo đối tượng cursor
cursor = connection.cursor()

# Thực hiện lệnh INSERT
cursor.execute("INSERT INTO Car_Order (CustomerID, CarID, Amount, SalePrice, OrderDate) VALUES (%s, %s, %s, %s, %s)",
               (2, 1, 4, 25000.00, '1999-01-15'))

# Lấy số lượng bản ghi đã được thêm vào
inserted_rows = cursor.rowcount
print("Số lượng bản ghi đã được thêm vào:", inserted_rows)

# Thực hiện lệnh DELETE
cursor.execute("DELETE FROM Car_Order WHERE YEAR(OrderDate) = 1999")

# Lấy số lượng bản ghi đã bị ảnh hưởng bởi lệnh DELETE
deleted_rows = cursor.rowcount
print("Số lượng bản ghi đã bị xóa:", deleted_rows)

# Lưu thay đổi và đóng kết nối
connection.commit()
cursor.close()
connection.close()

Số lượng bản ghi đã được thêm vào: 1
Số lượng bản ghi đã bị xóa: 1

# Question 5. Viết 1 thủ tục (có CustomerID Parameter) để in ra thông tin của các Đơn hàng đã đặt hàng (Tên của khách hàng, Mã đơn hàng, Số lượng Ô-tô và Tên hãng sản xuất)

In [13]:
%%sql
SELECT      cu.Name, co.OrderID, co.Amount, ca.Maker
FROM        Car_Order   AS co
LEFT JOIN   Customers   AS cu   ON cu.CustomerID    =   co.CustomerID
LEFT JOIN   Cars        AS ca   ON ca.CarID         =   co.CarID
WHERE       co.CustomerID = 2;

 * mysql://root:***@localhost/TestingExam_Db
4 rows affected.

[('Nguyễn Thị Hương', 1, 4, 'HONDA'),
 ('Nguyễn Thị Hương', 17, 2, 'TOYOTA'),
 ('Nguyễn Thị Hương', 34, 3, 'HONDA'),
 ('Nguyễn Thị Hương', 38, 5, 'NISSAN')]

In [15]:
%%sql
DROP    PROCEDURE IF EXISTS sp_GetCustomerOrders;
CREATE  PROCEDURE           sp_GetCustomerOrders(IN CustomerID INT)
BEGIN
    SELECT      cu.Name, co.OrderID, co.Amount, ca.Maker
    FROM        Car_Order   AS co
    LEFT JOIN   Customers   AS cu   ON cu.CustomerID    =   co.CustomerID
    LEFT JOIN   Cars        AS ca   ON ca.CarID         =   co.CarID
    WHERE       co.CustomerID = CustomerID;
END;

 * mysql://root:***@localhost/TestingExam_Db
0 rows affected.
0 rows affected.

[]

In [17]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='TestingExam_Db')
cursor = conn.cursor()
cursor.callproc('GetCustomerOrders', (2,))

results = cursor.fetchall()
for record in results:
    print(record)

('Nguyễn Thị Hương', 1, 4, 'HONDA')
('Nguyễn Thị Hương', 17, 2, 'TOYOTA')
('Nguyễn Thị Hương', 34, 3, 'HONDA')
('Nguyễn Thị Hương', 38, 5, 'NISSAN')

# Question 6. Viết Trigger để tránh trường hợp User nhập thông tin không hợp lệ vào Database (DeliveryDate < OrderDate + 15)

Kiểm tra số lượng Trigger hiện có

In [5]:
%%sql
SELECT  *
FROM    INFORMATION_SCHEMA.TRIGGERS;

 * mysql://root:***@localhost/testingexam_db
2 rows affected.

[('def', 'sys', 'sys_config_insert_set_user', 'INSERT', 'def', 'sys', 'sys_config', 1, None, 'BEGIN\n    IF @sys.ignore_sys_config_triggers != true AND NEW.set_by IS NULL THEN\n        SET NEW.set_by = USER();\n    END IF;\nEND', 'ROW', 'BEFORE', None, None, 'OLD', 'NEW', datetime.datetime(2024, 5, 1, 19, 52, 21, 60000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'mysql.sys@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('def', 'sys', 'sys_config_update_set_user', 'UPDATE', 'def', 'sys', 'sys_config', 1, None, 'BEGIN\n    IF @sys.ignore_sys_config_triggers != true AND NEW.set_by IS NULL THEN\n        SET NEW.set_by = USER();\n    END IF;\nEND', 'ROW', 'BEFORE', None, None, 'OLD', 'NEW', datetime.datetime(2024, 5, 1, 19, 52, 21, 60000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'mysql.sys@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [12]:
%%sql
DROP    TRIGGER IF EXISTS   Trg_BeforeInsertOrUpdateCarOrder;
CREATE  TRIGGER             Trg_BeforeInsertOrUpdateCarOrder
BEFORE INSERT ON            Car_Order
FOR EACH ROW
BEGIN
    IF NEW.DeliveryDate < DATE_ADD(NEW.OrderDate, INTERVAL 15 DAY) THEN
        SIGNAL SQLSTATE '45000' 
        SET MESSAGE_TEXT = 'DeliveryDate must be at least 15 days after OrderDate';
    END IF;
END;


DROP    TRIGGER IF EXISTS   Trg_BeforeUpdateCarOrder;
CREATE  TRIGGER             Trg_BeforeUpdateCarOrder
BEFORE UPDATE ON Car_Order
FOR EACH ROW
BEGIN
    IF NEW.DeliveryDate < DATE_ADD(NEW.OrderDate, INTERVAL 15 DAY) THEN
        SIGNAL SQLSTATE '45000' 
        SET MESSAGE_TEXT = 'DeliveryDate must be at least 15 days after OrderDate';
    END IF;
END;

 * mysql://root:***@localhost/testingexam_db
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

2 trigger mới được thêm vào

In [13]:
%%sql
SELECT  *
FROM    INFORMATION_SCHEMA.TRIGGERS;

 * mysql://root:***@localhost/testingexam_db
4 rows affected.

[('def', 'sys', 'sys_config_insert_set_user', 'INSERT', 'def', 'sys', 'sys_config', 1, None, 'BEGIN\n    IF @sys.ignore_sys_config_triggers != true AND NEW.set_by IS NULL THEN\n        SET NEW.set_by = USER();\n    END IF;\nEND', 'ROW', 'BEFORE', None, None, 'OLD', 'NEW', datetime.datetime(2024, 5, 1, 19, 52, 21, 60000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'mysql.sys@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('def', 'sys', 'sys_config_update_set_user', 'UPDATE', 'def', 'sys', 'sys_config', 1, None, 'BEGIN\n    IF @sys.ignore_sys_config_triggers != true AND NEW.set_by IS NULL THEN\n        SET NEW.set_by = USER();\n    END IF;\nEND', 'ROW', 'BEFORE', None, None, 'OLD', 'NEW', datetime.datetime(2024, 5, 1, 19, 52, 21, 60000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'mysql.sys@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('def', 'testingexam_db', 'Trg_BeforeInsertOrUpdateCarOrder', 'INSERT', 'def', 'testingexam_db', 'car_order', 1, None, "BEGIN\n    IF NEW.DeliveryDate < DATE_ADD(NEW.OrderDate, INTERVAL 15 DAY) THEN\n        SIGNAL SQLSTATE '45000' \n        SET MESSAGE_TEXT = 'DeliveryDate must be at least 15 days after OrderDate';\n    END IF;\nEND", 'ROW', 'BEFORE', None, None, 'OLD', 'NEW', datetime.datetime(2024, 5, 22, 15, 12, 15, 10000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('def', 'testingexam_db', 'Trg_BeforeUpdateCarOrder', 'UPDATE', 'def', 'testingexam_db', 'car_order', 1, None, "BEGIN\n    IF NEW.DeliveryDate < DATE_ADD(NEW.OrderDate, INTERVAL 15 DAY) THEN\n        SIGNAL SQLSTATE '45000' \n        SET MESSAGE_TEXT = 'DeliveryDate must be at least 15 days after OrderDate';\n    END IF;\nEND", 'ROW', 'BEFORE', None, None, 'OLD', 'NEW', datetime.datetime(2024, 5, 22, 15, 12, 15, 10000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [14]:
%%sql
INSERT INTO Car_Order   (CustomerID , CarID , Amount, SalePrice , OrderDate     , DeliveryDate  , DeliveryAddress                                       , Status)
VALUES                  (2          , 1     , 4     , 25000.00  , '2024-05-10'  , '2022-01-20'  , '123 Nguyễn Văn Cừ, Quận Bình Thạnh, Tp. Hồ Chí Minh' , 1     );

 * mysql://root:***@localhost/testingexam_db
(MySQLdb.OperationalError) (1644, 'DeliveryDate must be at least 15 days after OrderDate')
[SQL: INSERT INTO Car_Order   (CustomerID , CarID , Amount, SalePrice , OrderDate     , DeliveryDate  , DeliveryAddress                                       , Status)
VALUES                  (2          , 1     , 4     , 25000.00  , '2024-05-10'  , '2022-01-20'  , '123 Nguyễn Văn Cừ, Quận Bình Thạnh, Tp. Hồ Chí Minh' , 1     );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)